# FamilySelfOrienting Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..FamilySelfOrienting Property
ParameterTypeId Class See Also
---
"Align to View"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId FamilySelfOrienting { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FamilySelfOrienting As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ FamilySelfOrienting {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace